
[
  {
    "id": 1,
    "section": "Overview and Peritoneum",
    "stem": "A nursing student is studying the layers of the digestive tract. Which statement correctly describes the histological organization of the digestive tract from the lumen outward?",
    "choices": {
      "A": "Serosa, muscularis externa, submucosa, mucosa",
      "B": "Mucosa, submucosa, muscularis externa, serosa",
      "C": "Submucosa, mucosa, muscularis externa, serosa",
      "D": "Muscularis externa, submucosa, mucosa, serosa"
    },
    "correct": "B",
    "rationale": "According to the Anatomy of Digestive system 1.pdf (Page 10), the four layers from the lumen outward are: 1. Mucosa, 2. Submucosa, 3. Muscularis externa, and 4. Serosa. The mucosa lines the lumen, followed by submucosa (connective tissue), then muscularis externa (muscle layer), and finally serosa as the outermost layer."
  },
  {
    "id": 2,
    "section": "Overview and Peritoneum",
    "stem": "A patient is diagnosed with peritonitis following a ruptured appendix. The nurse understands that the peritoneum consists of which two layers?",
    "choices": {
      "A": "Visceral peritoneum covering organs and parietal peritoneum lining the body wall",
      "B": "Mesentery and omentum only",
      "C": "Intraperitoneal and retroperitoneal layers",
      "D": "Greater and lesser sacs"
    },
    "correct": "A",
    "rationale": "According to Anatomy of Digestive system 1.pdf (Page 5), the peritoneum consists of the visceral peritoneum (on external surface of most digestive organs) and parietal peritoneum (lines the body wall). The peritoneal cavity is the fluid-filled space between these two layers."
  },
  {
    "id": 3,
    "section": "Overview and Peritoneum",
    "stem": "During an abdominal assessment, the nurse recalls that certain digestive organs are classified as retroperitoneal. Which of the following organs is retroperitoneal?",
    "choices": {
      "A": "Stomach",
      "B": "Jejunum",
      "C": "Pancreas",
      "D": "Ileum"
    },
    "correct": "C",
    "rationale": "According to Anatomy of Digestive system 1.pdf (Page 5), retroperitoneal organs are located outside or posterior to the peritoneum and include the pancreas, duodenum, ascending colon, and descending colon. Intraperitoneal organs include the stomach, ileum, and jejunum."
  },
  {
    "id": 4,
    "section": "Overview and Peritoneum",
    "stem": "A nursing instructor asks a student to explain the function of the mesentery. Which response is most accurate?",
    "choices": {
      "A": "It produces digestive enzymes",
      "B": "It provides routes for blood vessels, lymphatics, and nerves to digestive organs",
      "C": "It secretes hydrochloric acid",
      "D": "It forms the outermost layer of the digestive tract"
    },
    "correct": "B",
    "rationale": "According to Anatomy of Digestive system 1.pdf (Page 5), the mesentery is a double layer of peritoneum that extends from the body wall to digestive organs, providing routes for blood vessels, lymphatics, and nerves. It also holds organs in place and stores fat."
  },
  {
    "id": 5,
    "section": "Overview and Peritoneum",
    "stem": "A patient with liver disease has fluid accumulation in the peritoneal cavity. The nurse understands this space normally contains:",
    "choices": {
      "A": "Air to allow organ movement",
      "B": "Fluid that lubricates mobile organs",
      "C": "Solid connective tissue",
      "D": "Adipose tissue for insulation"
    },
    "correct": "B",
    "rationale": "According to Anatomy of Digestive system 1.pdf (Page 5), the peritoneal cavity is a fluid-filled space between the visceral and parietal peritoneum. The fluid lubricates mobile organs, allowing them to move smoothly against each other."
  },
  {
    "id": 6,
    "section": "Overview and Peritoneum",
    "stem": "The nurse is caring for a patient who had a gastrectomy. The surgeon mentions that the stomach was an intraperitoneal organ. This means the stomach is:",
    "choices": {
      "A": "Located outside the peritoneal cavity",
      "B": "Located within the peritoneum",
      "C": "Attached only by the mesentery",
      "D": "Posterior to the peritoneal cavity"
    },
    "correct": "B",
    "rationale": "According to Anatomy of Digestive system 1.pdf (Page 5), intraperitoneal organs are located within the peritoneum and include the stomach, ileum, and jejunum. Retroperitoneal organs are located outside or posterior to the peritoneum."
  },
  {
    "id": 7,
    "section": "Overview and Peritoneum",
    "stem": "A nursing student is identifying anatomical structures. Which structure is a double layer of peritoneum that extends from the body wall to digestive organs?",
    "choices": {
      "A": "Falciform ligament",
      "B": "Mesentery",
      "C": "Greater omentum",
      "D": "Lesser omentum"
    },
    "correct": "B",
    "rationale": "According to Anatomy of Digestive system 1.pdf (Page 5), the mesentery is a double layer of peritoneum with layers fused back to back that extends from the body wall to digestive organs. It provides routes for blood vessels, lymphatics, and nerves."
  },
  {
    "id": 8,
    "section": "Overview and Peritoneum",
    "stem": "The nurse is reviewing the anatomy of the abdominal cavity. Which statement correctly distinguishes between intraperitoneal and retroperitoneal organs?",
    "choices": {
      "A": "The stomach and pancreas are both intraperitoneal",
      "B": "The duodenum and ascending colon are retroperitoneal",
      "C": "The jejunum and descending colon are both retroperitoneal",
      "D": "The liver and pancreas are both intraperitoneal"
    },
    "correct": "B",
    "rationale": "According to Anatomy of Digestive system 1.pdf (Page 5), retroperitoneal organs include the pancreas, duodenum, ascending colon, and descending colon. Intraperitoneal organs include the stomach, ileum, and jejunum."
  },
  {
    "id": 9,
    "section": "Overview and Peritoneum",
    "stem": "A patient is scheduled for surgery involving the peritoneum. The nurse explains that this serous membrane:",
    "choices": {
      "A": "Covers only the abdominal wall",
      "B": "Has a visceral layer covering organs and a parietal layer lining the body wall",
      "C": "Is a single layer covering all abdominal organs",
      "D": "Is found only in the thoracic cavity"
    },
    "correct": "B",
    "rationale": "According to Anatomy of Digestive system 1.pdf (Page 5), the peritoneum is a serous membrane consisting of visceral peritoneum (on external surface of most digestive organs) and parietal peritoneum (lines the body wall)."
  },
  {
    "id": 10,
    "section": "Overview and Peritoneum",
    "stem": "The nurse is teaching a patient about the greater omentum. Which function should the nurse include?",
    "choices": {
      "A": "Produces digestive enzymes",
      "B": "Stores fat and holds organs in place",
      "C": "Secretes hydrochloric acid",
      "D": "Absorbs nutrients"
    },
    "correct": "B",
    "rationale": "While not explicitly detailed in the text regarding the omentum specifically, Anatomy of Digestive system 1.pdf (Page 5) states that mesentery (which includes omenta) holds organs in place and stores fat. The greater omentum is a specific type of mesentery with these functions. Questions 11-20: Histological Organization"
  },
  {
    "id": 11,
    "section": "Histological Organization",
    "stem": "A biopsy of the esophageal lining is obtained from a patient with Barrett's esophagus. Normally, the epithelium of the esophagus is:",
    "choices": {
      "A": "Simple columnar epithelium",
      "B": "Stratified squamous epithelium",
      "C": "Pseudostratified columnar epithelium",
      "D": "Transitional epithelium"
    },
    "correct": "B",
    "rationale": "According to Anatomy of Digestive system 1.pdf (Page 10), the mouth, esophagus, and anus are made up of stratified squamous epithelium, while most of the rest of the tract has simple columnar epithelium."
  },
  {
    "id": 12,
    "section": "Histological Organization",
    "stem": "The nurse is reviewing the layers of the digestive tract. Which layer contains blood vessels, lymphatic vessels, and lymphoid follicles?",
    "choices": {
      "A": "Mucosa",
      "B": "Submucosa",
      "C": "Muscularis externa",
      "D": "Serosa"
    },
    "correct": "B",
    "rationale": "According to Anatomy of Digestive system 1.pdf (Page 10), the submucosa consists of connective tissue, blood and lymphatic vessels, lymphoid follicles, and nerve plexus."
  },
  {
    "id": 13,
    "section": "Histological Organization",
    "stem": "A patient has a condition affecting the muscularis externa. The nurse understands that this layer is responsible for:",
    "choices": {
      "A": "Secretion of digestive enzymes",
      "B": "Absorption of nutrients",
      "C": "Movement through peristalsis",
      "D": "Protection from pathogens"
    },
    "correct": "C",
    "rationale": "According to Anatomy of Digestive system 1.pdf (Page 10), the muscularis externa is the muscle layer responsible for movement. It contains inner circular muscle and outer longitudinal layers, with circular layer thickening in some areas to form sphincters."
  },
  {
    "id": 14,
    "section": "Histological Organization",
    "stem": "The nurse is educating a patient about how the digestive tract protects itself from acid. Which layer of the stomach contains mucus-secreting cells?",
    "choices": {
      "A": "Serosa",
      "B": "Muscularis externa",
      "C": "Submucosa",
      "D": "Mucosa"
    },
    "correct": "D",
    "rationale": "According to Anatomy of Digestive system 1.pdf (Page 10), the mucosa contains epithelium with mucus-secreting cells in most of the tract. In the stomach specifically, mucous neck cells secrete thin mucus."
  },
  {
    "id": 15,
    "section": "Histological Organization",
    "stem": "A nursing student identifies that the outermost layer of the intraperitoneal organs is the:",
    "choices": {
      "A": "Adventitia",
      "B": "Serosa",
      "C": "Submucosa",
      "D": "Muscularis mucosa"
    },
    "correct": "B",
    "rationale": "According to Anatomy of Digestive system 1.pdf (Page 10), the serosa is the outermost layer and is the visceral peritoneum. It is replaced by fibrous adventitia in the esophagus to bind it to surrounding tissues."
  },
  {
    "id": 16,
    "section": "Histological Organization",
    "stem": "The nurse is assessing a patient with a disorder affecting the lamina propria. This structure is part of which layer?",
    "choices": {
      "A": "Mucosa",
      "B": "Submucosa",
      "C": "Muscularis externa",
      "D": "Serosa"
    },
    "correct": "A",
    "rationale": "According to Anatomy of Digestive system 1.pdf (Page 10), the mucosa is made up of three sublayers: epithelium, lamina propria (loose areolar connective tissue), and muscularis mucosae."
  },
  {
    "id": 17,
    "section": "Histological Organization",
    "stem": "A patient has inflammation of the digestive tract affecting the muscularis mucosae. This thin muscle layer is found in the:",
    "choices": {
      "A": "Submucosa",
      "B": "Mucosa",
      "C": "Muscularis externa",
      "D": "Serosa"
    },
    "correct": "B",
    "rationale": "According to Anatomy of Digestive system 1.pdf (Page 10), the mucosa consists of three sublayers: epithelium, lamina propria, and muscularis mucosae."
  },
  {
    "id": 18,
    "section": "Histological Organization",
    "stem": "The nurse understands that sphincters in the digestive tract are formed by thickening of which layer?",
    "choices": {
      "A": "Mucosa",
      "B": "Submucosa",
      "C": "Inner circular layer of muscularis externa",
      "D": "Outer longitudinal layer of muscularis externa"
    },
    "correct": "C",
    "rationale": "According to Anatomy of Digestive system 1.pdf (Page 10), the circular layer of the muscularis externa thickens in some areas to form sphincters."
  },
  {
    "id": 19,
    "section": "Histological Organization",
    "stem": "A patient has a condition affecting the adventitia of the esophagus. The nurse knows that this structure:",
    "choices": {
      "A": "Is the same as serosa",
      "B": "Binds the esophagus to surrounding tissues",
      "C": "Secretes digestive enzymes",
      "D": "Forms sphincters"
    },
    "correct": "B",
    "rationale": "According to Anatomy of Digestive system 1.pdf (Page 10), the serosa is replaced by fibrous adventitia in the esophagus to bind the esophagus to surrounding tissues."
  },
  {
    "id": 20,
    "section": "Histological Organization",
    "stem": "The nurse is reviewing the histology of the digestive tract. Which statement about the epithelial lining is correct?",
    "choices": {
      "A": "The entire digestive tract is lined by simple columnar epithelium",
      "B": "The mouth and esophagus are lined by stratified squamous epithelium",
      "C": "The stomach is lined by stratified squamous epithelium",
      "D": "The small intestine is lined by transitional epithelium"
    },
    "correct": "B",
    "rationale": "According to Anatomy of Digestive system 1.pdf (Page 10), the mouth, esophagus, and anus are lined by stratified squamous epithelium. Most of the rest of the tract has simple columnar epithelium. Questions 21-30: Oral Cavity, Salivary Glands, and Teeth"
  },
  {
    "id": 21,
    "section": "Oral Cavity, Salivary Glands, and Teeth",
    "stem": "A patient presents with swelling anterior to the ear. The nurse suspects inflammation of which salivary gland?",
    "choices": {
      "A": "Submandibular gland",
      "B": "Parotid gland",
      "C": "Sublingual gland",
      "D": "Minor salivary gland"
    },
    "correct": "B",
    "rationale": "According to Anatomy of Digestive system 1.pdf (Page 17), the parotid gland is located anterior to the ear and external to the masseter muscle. Its duct opens into the oral vestibule next to the second upper molar."
  },
  {
    "id": 22,
    "section": "Oral Cavity, Salivary Glands, and Teeth",
    "stem": "The nurse is assessing a patient's tongue and notes a V-shaped row of papillae in the posterior region. These are most likely:",
    "choices": {
      "A": "Filiform papillae",
      "B": "Fungiform papillae",
      "C": "Vallate (circumvallate) papillae",
      "D": "Foliate papillae"
    },
    "correct": "C",
    "rationale": "According to Anatomy of Digestive system 1.pdf (Page 14), vallate (circumvallate) papillae are 8-12 in number and form a V-shaped row in the back of the tongue."
  },
  {
    "id": 23,
    "section": "Oral Cavity, Salivary Glands, and Teeth",
    "stem": "A patient complains of dry mouth (xerostomia) during stressful situations. The nurse understands this is likely due to:",
    "choices": {
      "A": "Parasympathetic inhibition only",
      "B": "Sympathetic stimulation producing viscous saliva",
      "C": "Increased vagal nerve activity",
      "D": "Overactive salivary nuclei in the brain stem"
    },
    "correct": "B",
    "rationale": "According to Physiology Digestive system 1.pdf (Page 10), sympathetic stimulation (T1-T3) produces viscous saliva, causing dry mouth during stress. Parasympathetic stimulation initiates and maintains watery saliva secretion."
  },
  {
    "id": 24,
    "section": "Oral Cavity, Salivary Glands, and Teeth",
    "stem": "The nurse is providing oral care to a patient and notices the lingual frenulum. This structure:",
    "choices": {
      "A": "Separates the oral cavity from the nasal cavity",
      "B": "Attaches the tongue to the floor of the mouth",
      "C": "Forms the V-shaped row of papillae",
      "D": "Marks the division between the body and root of the tongue"
    },
    "correct": "B",
    "rationale": "According to Anatomy of Digestive system 1.pdf (Page 14), the lingual frenulum is the attachment of the tongue to the floor of the mouth."
  },
  {
    "id": 25,
    "section": "Oral Cavity, Salivary Glands, and Teeth",
    "stem": "A dental hygienist is teaching a patient about tooth development. The primary (deciduous) dental formula indicates how many teeth?",
    "choices": {
      "A": "32 teeth",
      "B": "28 teeth",
      "C": "20 teeth",
      "D": "24 teeth"
    },
    "correct": "C",
    "rationale": "According to Anatomy of Digestive system 1.pdf (Page 20), the primary dental formula is 2I, 1C, 2M (upper jaw) × 2 = 20 teeth. The permanent formula shows 32 teeth."
  },
  {
    "id": 26,
    "section": "Oral Cavity, Salivary Glands, and Teeth",
    "stem": "A patient has lost the sense of taste following a viral infection. The nurse recalls that which type of papillae do NOT contain taste buds?",
    "choices": {
      "A": "Fungiform",
      "B": "Vallate",
      "C": "Foliate",
      "D": "Filiform"
    },
    "correct": "D",
    "rationale": "According to Anatomy of Digestive system 1.pdf (Page 14), filiform papillae give roughness to provide friction but do NOT contain taste buds. Fungiform, vallate, and foliate papillae do contain taste buds."
  },
  {
    "id": 27,
    "section": "Oral Cavity, Salivary Glands, and Teeth",
    "stem": "The nurse is assessing a patient with a suspected salivary duct obstruction. The submandibular gland duct opens:",
    "choices": {
      "A": "Next to the second upper molar",
      "B": "At the base of the lingual frenulum",
      "C": "Via 10-12 ducts into the floor of the mouth",
      "D": "Into the oropharynx"
    },
    "correct": "B",
    "rationale": "According to Anatomy of Digestive system 1.pdf (Page 17), the submandibular gland duct opens at the base of the lingual frenulum. The parotid duct opens next to the second upper molar, and the sublingual gland opens via 10-12 ducts into the floor of the mouth."
  },
  {
    "id": 28,
    "section": "Oral Cavity, Salivary Glands, and Teeth",
    "stem": "A patient has inflammation of the lingual tonsil. The nurse understands this structure is located:",
    "choices": {
      "A": "On the body of the tongue",
      "B": "In the root of the tongue",
      "C": "On the hard palate",
      "D": "In the cheeks"
    },
    "correct": "B",
    "rationale": "According to Anatomy of Digestive system 1.pdf (Page 14), the root of the tongue (posterior third residing in the oropharynx) is bumpy because of the lingual tonsil, which lies deep to its mucosa."
  },
  {
    "id": 29,
    "section": "Oral Cavity, Salivary Glands, and Teeth",
    "stem": "The nurse is teaching a patient about the functions of saliva. Which component of saliva provides protection against bacteria?",
    "choices": {
      "A": "Mucus only",
      "B": "Amylase only",
      "C": "Lysozyme, IgA, and defensins",
      "D": "Lipase only"
    },
    "correct": "C",
    "rationale": "According to Physiology Digestive system 1.pdf (Page 9), saliva provides protection through lysozyme (prevents bacterial growth/tooth decay), IgA, cyanide, and defensins. Lubrication is provided by mucus, and digestion by amylase and lipase."
  },
  {
    "id": 30,
    "section": "Oral Cavity, Salivary Glands, and Teeth",
    "stem": "A patient has a tumor affecting the intrinsic muscles of the tongue. This will most likely affect the ability to:",
    "choices": {
      "A": "Move the tongue from side to side",
      "B": "Change the shape of the tongue",
      "C": "Attach the tongue to the floor of the mouth",
      "D": "Alter the position of the tongue"
    },
    "correct": "B",
    "rationale": "According to Anatomy of Digestive system 1.pdf (Page 13), intrinsic muscles change the shape of the tongue, while extrinsic muscles alter the tongue's position. Questions 31-40: Pharynx and Esophagus"
  },
  {
    "id": 31,
    "section": "Pharynx and Esophagus",
    "stem": "The nurse is reviewing the anatomy of the pharynx. Which statement correctly describes its structure and function?",
    "choices": {
      "A": "It allows passage of food only",
      "B": "It is lined by simple columnar epithelium",
      "C": "It allows passage of food, fluids, and air",
      "D": "It has no muscle layers"
    },
    "correct": "C",
    "rationale": "According to Anatomy of Digestive system 1.pdf (Page 22), the pharynx allows passage of food, fluids, and air. It is lined by stratified squamous epithelium with mucus-producing glands and has inner longitudinal and outer constrictor muscle layers."
  },
  {
    "id": 32,
    "section": "Pharynx and Esophagus",
    "stem": "A patient with gastroesophageal reflux disease (GERD) asks about the structure that normally prevents stomach acid from entering the esophagus. The nurse explains that this is the:",
    "choices": {
      "A": "Pyloric sphincter",
      "B": "Cardiac orifice without a sphincter",
      "C": "Gastroesophageal (cardiac) sphincter",
      "D": "Ileocecal valve"
    },
    "correct": "C",
    "rationale": "According to Anatomy of Digestive system 1.pdf (Page 23), the gastroesophageal (cardiac) sphincter surrounds the cardinal orifice and keeps the orifice closed when food is not being swallowed. Physiology Digestive system 1.pdf (Page 14) notes that when this sphincter fails, GERD occurs."
  },
  {
    "id": 33,
    "section": "Pharynx and Esophagus",
    "stem": "A nursing student is studying the layers of the esophageal muscularis externa. Which statement is correct?",
    "choices": {
      "A": "It contains only smooth muscle throughout",
      "B": "It contains only skeletal muscle throughout",
      "C": "It contains skeletal muscle superiorly, mixed in the middle, and smooth muscle inferiorly",
      "D": "It contains smooth muscle superiorly and skeletal muscle inferiorly"
    },
    "correct": "C",
    "rationale": "According to Anatomy of Digestive system 1.pdf (Page 23), the muscularis externa of the esophagus contains skeletal muscle superiorly, mixed muscle in the middle, and smooth muscle inferiorly."
  },
  {
    "id": 34,
    "section": "Pharynx and Esophagus",
    "stem": "The nurse is caring for a patient with a hiatal hernia. The esophagus pierces the diaphragm at which structure?",
    "choices": {
      "A": "Cardiac orifice",
      "B": "Esophageal hiatus",
      "C": "Pyloric opening",
      "D": "Gastroesophageal junction"
    },
    "correct": "B",
    "rationale": "According to Anatomy of Digestive system 1.pdf (Page 23), the esophagus pierces the diaphragm at the esophageal hiatus."
  },
  {
    "id": 35,
    "section": "Pharynx and Esophagus",
    "stem": "A patient reports heartburn after meals. The nurse explains that the lower esophageal sphincter (LES) is a physiological sphincter that:",
    "choices": {
      "A": "Is composed of thick circular smooth muscle only",
      "B": "Relaxes with the arrival of peristaltic waves",
      "C": "Remains constantly contracted",
      "D": "Is under voluntary control"
    },
    "correct": "B",
    "rationale": "According to Anatomy of Digestive system 1.pdf (Page 24), the lower esophageal sphincter (LES) is a physiological sphincter that relaxes with the arrival of peristaltic waves."
  },
  {
    "id": 36,
    "section": "Pharynx and Esophagus",
    "stem": "The nurse is reviewing the blood supply to the esophagus. In the thorax, the esophagus is related to which structures?",
    "choices": {
      "A": "Right atrium and ascending aorta",
      "B": "Left atrium and descending aorta",
      "C": "Superior vena cava and pulmonary artery",
      "D": "Trachea and bronchi only"
    },
    "correct": "B",
    "rationale": "According to Anatomy of Digestive system 1.pdf (Page 24), in the thorax, the esophagus passes through the posterior mediastinum and is related to the left atrium and descending aorta."
  },
  {
    "id": 37,
    "section": "Pharynx and Esophagus",
    "stem": "A patient is about to undergo an endoscopy. The nurse knows that at the gastroesophageal junction, the epithelial lining changes from:",
    "choices": {
      "A": "Simple columnar to stratified squamous",
      "B": "Stratified squamous to simple columnar",
      "C": "Transitional to pseudostratified",
      "D": "Pseudostratified to simple columnar"
    },
    "correct": "B",
    "rationale": "According to Anatomy of Digestive system 1.pdf (Page 23), the esophageal mucosa contains stratified squamous epithelium, which changes to simple columnar at the stomach."
  },
  {
    "id": 38,
    "section": "Pharynx and Esophagus",
    "stem": "The nurse is teaching about esophageal glands. These glands are located in which layer and serve what function?",
    "choices": {
      "A": "Mucosa; enzyme secretion",
      "B": "Submucosa; mucus secretion for lubrication",
      "C": "Muscularis; peristalsis",
      "D": "Serosa; protection"
    },
    "correct": "B",
    "rationale": "According to Anatomy of Digestive system 1.pdf (Page 25), the esophagus has mucus-secreting glands in the submucosa aiding lubrication and movement."
  },
  {
    "id": 39,
    "section": "Pharynx and Esophagus",
    "stem": "A patient has difficulty swallowing (dysphagia). The nurse recalls that the esophagus begins at which vertebral level?",
    "choices": {
      "A": "Cervical vertebral level 4",
      "B": "Cervical vertebral level 6",
      "C": "Thoracic vertebral level 2",
      "D": "Thoracic vertebral level 4"
    },
    "correct": "B",
    "rationale": "According to Anatomy of Digestive system 1.pdf (Page 24), the esophagus begins at cervical vertebral level 6 and lies posterior to the trachea."
  },
  {
    "id": 40,
    "section": "Pharynx and Esophagus",
    "stem": "The nurse is caring for a patient with achalasia, a condition where the LES fails to relax. Normally, the esophagus:",
    "choices": {
      "A": "Remains open continuously",
      "B": "Is collapsed when not involved in food propulsion",
      "C": "Is always filled with air",
      "D": "Contracts constantly"
    },
    "correct": "B",
    "rationale": "According to Anatomy of Digestive system 1.pdf (Page 23), the esophagus is a flat muscular tube that is collapsed when not involved in food propulsion. Questions 41-50: Stomach"
  },
  {
    "id": 41,
    "section": "Stomach",
    "stem": "A patient is scheduled for a gastric resection. The surgeon explains that the stomach can expand significantly. What is the approximate volume of an empty stomach and its maximum capacity?",
    "choices": {
      "A": "10 ml empty; 1 L maximum",
      "B": "50 ml empty; 4 L maximum",
      "C": "100 ml empty; 2 L maximum",
      "D": "200 ml empty; 3 L maximum"
    },
    "correct": "B",
    "rationale": "According to Anatomy of Digestive system 1.pdf (Page 27), an empty stomach has approximately 50 ml volume but can expand to 4 L."
  },
  {
    "id": 42,
    "section": "Stomach",
    "stem": "During a gastric surgery, the surgeon identifies the region surrounding the cardinal orifice. This is the:",
    "choices": {
      "A": "Fundus",
      "B": "Body",
      "C": "Cardia",
      "D": "Pyloric antrum"
    },
    "correct": "C",
    "rationale": "According to Anatomy of Digestive system 1.pdf (Page 27), the cardia is the region that surrounds the cardial orifice."
  },
  {
    "id": 43,
    "section": "Stomach",
    "stem": "A patient with peptic ulcer disease has overactive parietal cells. The nurse understands that these cells secrete:",
    "choices": {
      "A": "Pepsinogen and gastrin",
      "B": "Hydrochloric acid and intrinsic factor",
      "C": "Mucus and bicarbonate",
      "D": "Somatostatin and histamine"
    },
    "correct": "B",
    "rationale": "According to Anatomy of Digestive system 1.pdf (Page 30), parietal cells secrete hydrochloric acid (pH 1.5–3.5) and intrinsic factor (required for absorption of vitamin B12 in the small intestine)."
  },
  {
    "id": 44,
    "section": "Stomach",
    "stem": "The nurse is reviewing gastric gland histology. Which cells secrete pepsinogen, which is activated to pepsin by HCl?",
    "choices": {
      "A": "Parietal cells",
      "B": "Chief cells",
      "C": "Mucous neck cells",
      "D": "Enteroendocrine cells"
    },
    "correct": "B",
    "rationale": "According to Anatomy of Digestive system 1.pdf (Page 30), chief cells secrete pepsinogen, which is activated to pepsin by HCl. Mucous neck cells secrete thin mucus, parietal cells secrete HCl and intrinsic factor, and enteroendocrine cells secrete gastrin."
  },
  {
    "id": 45,
    "section": "Stomach",
    "stem": "A patient's gastric analysis reveals low intrinsic factor production. The nurse anticipates that this patient may develop:",
    "choices": {
      "A": "Iron deficiency anemia",
      "B": "Vitamin B12 deficiency anemia",
      "C": "Folic acid deficiency",
      "D": "Hemolytic anemia"
    },
    "correct": "B",
    "rationale": "According to Anatomy of Digestive system 1.pdf (Page 30), parietal cells secrete intrinsic factor, which is required for absorption of vitamin B12 in the small intestine. Deficiency of intrinsic factor leads to vitamin B12 deficiency anemia (pernicious anemia)."
  },
  {
    "id": 46,
    "section": "Stomach",
    "stem": "The nurse is assessing a patient with a gastric tumor that has destroyed gastrin-secreting cells. Which cells are most likely affected?",
    "choices": {
      "A": "Parietal cells",
      "B": "Chief cells",
      "C": "Enteroendocrine cells (G cells)",
      "D": "Mucous neck cells"
    },
    "correct": "C",
    "rationale": "According to Anatomy of Digestive system 1.pdf (Page 30), enteroendocrine cells secrete gastrin. Gastrin stimulates HCl release from parietal cells."
  },
  {
    "id": 47,
    "section": "Stomach",
    "stem": "A patient asks how the stomach protects itself from its own acid. The nurse explains that mucous neck cells secrete:",
    "choices": {
      "A": "Thick, alkaline mucus",
      "B": "Thin mucus",
      "C": "Bicarbonate only",
      "D": "Hydrochloric acid"
    },
    "correct": "B",
    "rationale": "According to Anatomy of Digestive system 1.pdf (Page 30), mucous neck cells secrete thin mucus. (Note: Surface mucous cells secrete thick, alkaline mucus for protection.)"
  },
  {
    "id": 48,
    "section": "Stomach",
    "stem": "The nurse is reviewing the layers of the stomach's muscularis externa. Unlike other parts of the GI tract, the stomach has:",
    "choices": {
      "A": "Only one muscle layer",
      "B": "Two muscle layers",
      "C": "Three muscle layers (longitudinal, circular, and oblique)",
      "D": "Four muscle layers"
    },
    "correct": "C",
    "rationale": "According to Anatomy of Digestive system 1.pdf (Page 30), the muscularis externa of the stomach has three layers: circular, longitudinal, and an extra third layer called the oblique layer."
  },
  {
    "id": 49,
    "section": "Stomach",
    "stem": "A patient who had a gastrectomy asks about the rugae. The nurse explains that these are:",
    "choices": {
      "A": "Glands that secrete gastric juice",
      "B": "Folds in the stomach mucosa that disappear when the stomach is full",
      "C": "Sphincters that control gastric emptying",
      "D": "Blood vessels supplying the stomach"
    },
    "correct": "B",
    "rationale": "According to Anatomy of Digestive system 1.pdf (Page 27), when empty, the stomach mucosa forms many folds called rugae. These flatten as the stomach expands."
  },
  {
    "id": 50,
    "section": "Stomach",
    "stem": "The nurse is caring for a patient with a pyloric obstruction. The pyloric sphincter is located between the:",
    "choices": {
      "A": "Esophagus and stomach",
      "B": "Stomach and duodenum",
      "C": "Duodenum and jejunum",
      "D": "Ileum and cecum"
    },
    "correct": "B",
    "rationale": "According to Anatomy of Digestive system 1.pdf (Page 27), the pyloric part terminates in the pyloric sphincter, which controls emptying of stomach contents into the duodenum. Questions 51-60: Small Intestine"
  },
  {
    "id": 51,
    "section": "Small Intestine",
    "stem": "A nursing student is studying the subdivisions of the small intestine. Which statement correctly describes the duodenum?",
    "choices": {
      "A": "It is entirely intraperitoneal",
      "B": "It is mostly retroperitoneal and 25 cm long",
      "C": "It is 3.6 m long and attached by mesentery",
      "D": "It joins the large intestine at the ileocecal valve"
    },
    "correct": "B",
    "rationale": "According to Anatomy of Digestive system 1.pdf (Page 32), the duodenum is mostly retroperitoneal, approximately 25.0 cm long, and curves around the head of the pancreas."
  },
  {
    "id": 52,
    "section": "Small Intestine",
    "stem": "The nurse is teaching a patient about nutrient absorption. Which modification of the small intestine increases surface area by approximately 600 times?",
    "choices": {
      "A": "Circular folds only",
      "B": "Villi only",
      "C": "Microvilli only",
      "D": "Circular folds, villi, and microvilli together"
    },
    "correct": "D",
    "rationale": "According to Anatomy of Digestive system 1.pdf (Page 35), the small intestine's surface area is increased 600 times to 200 m² by three modifications: circular folds, villi, and microvilli."
  },
  {
    "id": 53,
    "section": "Small Intestine",
    "stem": "A patient has a condition affecting the lacteals in the small intestine. The nurse understands that these structures are:",
    "choices": {
      "A": "Blood capillaries that absorb amino acids",
      "B": "Lymphatic capillaries that absorb fatty acids",
      "C": "Glands that secrete intestinal juice",
      "D": "Nerves that control peristalsis"
    },
    "correct": "B",
    "rationale": "According to Anatomy of Digestive system 1.pdf (Page 35), villi contain a core with a blood capillary and a lymphatic capillary called a lacteal. Fatty acids are absorbed into the lacteal and transported via the lymphatic system."
  },
  {
    "id": 54,
    "section": "Small Intestine",
    "stem": "The nurse is reviewing the blood supply to the small intestine. The superior mesenteric artery supplies blood to the:",
    "choices": {
      "A": "Stomach only",
      "B": "Duodenum, jejunum, and ileum",
      "C": "Large intestine only",
      "D": "Esophagus only"
    },
    "correct": "B",
    "rationale": "According to Anatomy of Digestive system 1.pdf (Page 32), the small intestine receives blood from the superior mesenteric artery. Veins drain into superior mesenteric veins, then into the hepatic portal vein."
  },
  {
    "id": 55,
    "section": "Small Intestine",
    "stem": "A patient has a bacterial overgrowth in the distal small intestine. The nurse recalls that Peyer's patches, which protect against microorganisms, are most numerous in the:",
    "choices": {
      "A": "Duodenum",
      "B": "Proximal jejunum",
      "C": "Distal ileum",
      "D": "Entire small intestine equally"
    },
    "correct": "C",
    "rationale": "According to Anatomy of Digestive system 1.pdf (Page 41), Peyer's patches (aggregated lymphoid nodules) are found in great numbers in the distal part of the small intestine (ileum), where bacterial numbers increase."
  },
  {
    "id": 56,
    "section": "Small Intestine",
    "stem": "The nurse is educating a patient about the function of intestinal crypts. These structures:",
    "choices": {
      "A": "Produce hormones only",
      "B": "Produce intestinal juice and contain stem cells for epithelial renewal",
      "C": "Absorb nutrients",
      "D": "Contract to move chyme"
    },
    "correct": "B",
    "rationale": "According to Anatomy of Digestive system 1.pdf (Page 40), intestinal crypts produce intestinal juice and contain stem cells that continuously divide to produce other cell types. Villus epithelium is renewed every 2-4 days."
  },
  {
    "id": 57,
    "section": "Small Intestine",
    "stem": "A patient has a deficiency in brush border enzymes. The nurse understands that these enzymes are located on the:",
    "choices": {
      "A": "Circular folds",
      "B": "Microvilli",
      "C": "Basolateral membrane of enterocytes",
      "D": "Goblet cells"
    },
    "correct": "B",
    "rationale": "According to Anatomy of Digestive system 1.pdf (Page 35), microvilli are cytoplasmic extensions of mucosal cells that give a fuzzy appearance called the brush border. They contain membrane-bound brush border enzymes used for final carbohydrate and protein digestion."
  },
  {
    "id": 58,
    "section": "Small Intestine",
    "stem": "The nurse is reviewing the functions of different cell types in the small intestine. Which cells secrete antimicrobial agents such as defensins and lysozyme?",
    "choices": {
      "A": "Enterocytes",
      "B": "Goblet cells",
      "C": "Paneth cells",
      "D": "Enteroendocrine cells"
    },
    "correct": "C",
    "rationale": "According to Anatomy of Digestive system 1.pdf (Page 40), Paneth cells secrete antimicrobial agents (defensins and lysozyme) that can destroy bacteria."
  },
  {
    "id": 59,
    "section": "Small Intestine",
    "stem": "A patient has a duodenal ulcer. The nurse understands that the duodenal (Brunner's) glands secrete:",
    "choices": {
      "A": "Acidic juice to aid digestion",
      "B": "Alkaline mucus to neutralize acidic chyme",
      "C": "Enzymes to digest proteins",
      "D": "Hormones to regulate gastric emptying"
    },
    "correct": "B",
    "rationale": "According to Anatomy of Digestive system 1.pdf (Page 41), duodenal glands of the duodenum secrete alkaline mucus to neutralize acidic chyme entering from the stomach."
  },
  {
    "id": 60,
    "section": "Small Intestine",
    "stem": "The nurse is comparing the jejunum and ileum. Which statement correctly differentiates these two segments?",
    "choices": {
      "A": "The jejunum has more Peyer's patches than the ileum",
      "B": "The ileum has more circular folds than the jejunum",
      "C": "The jejunum has larger and more numerous plicae circularis than the ileum",
      "D": "The ileum is wider and thicker-walled than the jejunum"
    },
    "correct": "C",
    "rationale": "According to Physiology of Digestive System.pdf (Page 38), the jejunum has larger and more numerous plicae circularis, longer and more numerous villi, and absent Peyer's patches, while the ileum has smaller and less numerous plicae circularis, shorter and less numerous villi, and present Peyer's patches. Questions 61-70: Large Intestine, Liver, Gallbladder, and Pancreas"
  },
  {
    "id": 61,
    "section": "Large Intestine, Liver, Gallbladder, and Pancreas",
    "stem": "The nurse is assessing a patient with appendicitis. The appendix is located near the:",
    "choices": {
      "A": "Hepatic flexure",
      "B": "Splenic flexure",
      "C": "Cecum",
      "D": "Sigmoid colon"
    },
    "correct": "C",
    "rationale": "According to Anatomy of Digestive system 1.pdf (Page 43), the appendix is attached to the cecum, the first part of the large intestine. It contains masses of lymphoid tissue."
  },
  {
    "id": 62,
    "section": "Large Intestine, Liver, Gallbladder, and Pancreas",
    "stem": "A patient has a condition affecting the teniae coli. The nurse understands that these structures are:",
    "choices": {
      "A": "Fat-filled pouches of visceral peritoneum",
      "B": "Three bands of longitudinal smooth muscle in the muscularis of the colon",
      "C": "Pocket-like sacs caused by muscle tone",
      "D": "Valves that prevent backflow"
    },
    "correct": "B",
    "rationale": "According to Anatomy of Digestive system 1.pdf (Page 42), the large intestine has three unique features: teniae coli (three bands of longitudinal smooth muscle in muscularis), haustra (pocketlike sacs caused by tone of teniae coli), and epiploic appendages (fat-filled pouches of visceral peritoneum)."
  },
  {
    "id": 63,
    "section": "Large Intestine, Liver, Gallbladder, and Pancreas",
    "stem": "The nurse is teaching a patient about defecation. The external anal sphincter is composed of:",
    "choices": {
      "A": "Smooth muscle only",
      "B": "Skeletal muscle",
      "C": "Cardiac muscle",
      "D": "Both smooth and skeletal muscle"
    },
    "correct": "B",
    "rationale": "According to Anatomy of Digestive system 1.pdf (Page 44), the anus has two sphincters: the internal anal sphincter (smooth muscle) and the external anal sphincter (skeletal muscle). Physiology of Digestive System.pdf (Page 29) notes that the external anal sphincter is voluntary."
  },
  {
    "id": 64,
    "section": "Large Intestine, Liver, Gallbladder, and Pancreas",
    "stem": "A patient with cirrhosis has an enlarged liver. The nurse recalls that the liver is the largest gland in the body and consists of how many primary lobes?",
    "choices": {
      "A": "Two lobes: right and left",
      "B": "Three lobes: right, left, and caudate",
      "C": "Four lobes: right, left, caudate, and quadrate",
      "D": "Five lobes: right, left, caudate, quadrate, and round"
    },
    "correct": "C",
    "rationale": "According to Anatomy of Digestive system 1.pdf (Page 46), the liver consists of four primary lobes: right, left, caudate, and quadrate."
  },
  {
    "id": 65,
    "section": "Large Intestine, Liver, Gallbladder, and Pancreas",
    "stem": "The nurse is reviewing the microscopic anatomy of the liver. Which structures are found in the portal triad at each corner of a liver lobule?",
    "choices": {
      "A": "Central vein, bile duct, and lymphatic vessel",
      "B": "Branch of hepatic artery, branch of hepatic portal vein, and bile duct",
      "C": "Hepatic artery, hepatic vein, and hepatic duct",
      "D": "Kupffer cells, sinusoids, and central vein"
    },
    "correct": "B",
    "rationale": "According to Anatomy of Digestive system 1.pdf (Page 50), the portal triad in each corner of a liver lobule contains a branch of the hepatic artery (supplies oxygen), a branch of the hepatic portal vein (brings nutrient-rich blood from intestine), and a bile duct (receives bile from bile canaliculi)."
  },
  {
    "id": 66,
    "section": "Large Intestine, Liver, Gallbladder, and Pancreas",
    "stem": "A patient has a gallbladder attack after eating a fatty meal. The nurse understands that the gallbladder functions to:",
    "choices": {
      "A": "Produce bile",
      "B": "Store and concentrate bile",
      "C": "Produce digestive enzymes",
      "D": "Absorb nutrients"
    },
    "correct": "B",
    "rationale": "According to Anatomy of Digestive system 1.pdf (Page 53), the gallbladder is a thin-walled muscular sac on the ventral surface of the liver that functions to store and concentrate bile by absorbing water and ions. Muscular contractions release bile via the cystic duct."
  },
  {
    "id": 67,
    "section": "Large Intestine, Liver, Gallbladder, and Pancreas",
    "stem": "The nurse is caring for a patient with pancreatitis. The pancreas has both exocrine and endocrine functions. The exocrine function involves:",
    "choices": {
      "A": "Secretion of insulin and glucagon",
      "B": "Production of pancreatic juice containing digestive enzymes",
      "C": "Storage of bile",
      "D": "Absorption of nutrients"
    },
    "correct": "B",
    "rationale": "According to Anatomy of Digestive system 1.pdf (Page 55), the exocrine function of the pancreas is to produce pancreatic juice. Acini (clusters of secretory cells) produce zymogen granules containing proenzymes, and duct cells produce water and bicarbonate. The endocrine function involves secretion of insulin and glucagon."
  },
  {
    "id": 68,
    "section": "Large Intestine, Liver, Gallbladder, and Pancreas",
    "stem": "A patient has a bile duct obstruction. Which structure is formed by the union of the common hepatic duct and the cystic duct?",
    "choices": {
      "A": "Right and left hepatic ducts",
      "B": "Common bile duct",
      "C": "Pancreatic duct",
      "D": "Hepatopancreatic ampulla"
    },
    "correct": "B",
    "rationale": "According to Anatomy of Digestive system 1.pdf (Page 51), the common hepatic duct (CHD) is joined by the cystic duct to form the common bile duct (CBD). The CBD and pancreatic duct unite in the wall of the duodenum."
  },
  {
    "id": 69,
    "section": "Large Intestine, Liver, Gallbladder, and Pancreas",
    "stem": "The nurse is reviewing the blood supply to the liver. Which vessels bring blood to the liver?",
    "choices": {
      "A": "Hepatic vein only",
      "B": "Hepatic artery and hepatic portal vein",
      "C": "Superior mesenteric artery only",
      "D": "Gastric artery only"
    },
    "correct": "B",
    "rationale": "According to Anatomy of Digestive system 1.pdf (Page 50), blood from both the hepatic portal vein (nutrient-rich blood from intestine) and the hepatic artery proper (oxygenated blood) percolates from triad regions through sinusoids and empties into the central vein."
  },
  {
    "id": 70,
    "section": "Large Intestine, Liver, Gallbladder, and Pancreas",
    "stem": "A patient has a condition affecting Kupffer cells in the liver. The nurse understands that these cells function to:",
    "choices": {
      "A": "Produce bile",
      "B": "Remove debris and old red blood cells",
      "C": "Store vitamin A",
      "D": "Produce clotting factors"
    },
    "correct": "B",
    "rationale": "According to Anatomy of Digestive system 1.pdf (Page 50), hepatic macrophages (Kupffer cells) in the liver sinusoids remove debris and old red blood cells. Questions 71-80: Physiology of Digestion and Absorption"
  },
  {
    "id": 71,
    "section": "Physiology of Digestion and Absorption",
    "stem": "The nurse is teaching a patient about the regulation of gastric secretion. Which phase is triggered by the sight, smell, or thought of food?",
    "choices": {
      "A": "Gastric phase",
      "B": "Intestinal phase",
      "C": "Cephalic phase",
      "D": "Hepatic phase"
    },
    "correct": "C",
    "rationale": "According to Physiology Digestive system 1.pdf (Page 18), the cephalic phase is triggered by the smell, taste, sight, or thought of food before food enters the stomach. It is mediated by the vagus nerve and gets the stomach ready, lasting a few minutes."
  },
  {
    "id": 72,
    "section": "Physiology of Digestion and Absorption",
    "stem": "A patient asks why they feel nauseous when dizzy. The nurse explains that vomiting is a complex reflex coordinated in the:",
    "choices": {
      "A": "Cerebral cortex",
      "B": "Hypothalamus",
      "C": "Brain stem",
      "D": "Spinal cord"
    },
    "correct": "C",
    "rationale": "According to Physiology Digestive system 1.pdf (Page 19), vomiting is a complex reflex coordinated in the brain stem. Stimuli include stomach distension, seasickness or dizziness, pain, increased intracranial pressure, noxious chemicals, toxins, and drugs."
  },
  {
    "id": 73,
    "section": "Physiology of Digestion and Absorption",
    "stem": "The nurse is reviewing the function of bile salts. Which statement accurately describes their role in digestion?",
    "choices": {
      "A": "They chemically digest fats",
      "B": "They emulsify fats, breaking them into smaller droplets",
      "C": "They neutralize stomach acid",
      "D": "They absorb amino acids"
    },
    "correct": "B",
    "rationale": "According to Physiology Digestive system 1.pdf (Page 29), bile salts emulsify fat, which means they physically break down large fat globules into smaller droplets. This increases surface area for pancreatic lipase action. Chemical digestion of fats is performed by lipase."
  },
  {
    "id": 74,
    "section": "Physiology of Digestion and Absorption",
    "stem": "A patient with liver disease has prolonged bleeding. The nurse recalls that vitamin K, which is essential for synthesis of clotting factors, is:",
    "choices": {
      "A": "Produced by the liver",
      "B": "Synthesized by intestinal bacteria",
      "C": "Stored in the gallbladder",
      "D": "Absorbed in the stomach"
    },
    "correct": "B",
    "rationale": "According to Physiology Digestive system 1.pdf (Page 27), resident bacteria (bacterial flora) in the large intestine break down indigestible carbohydrates and synthesize some B-complex vitamins and significant amounts of vitamin K. Vitamin K is essential for the synthesis of some blood clotting factors in the liver."
  },
  {
    "id": 75,
    "section": "Physiology of Digestion and Absorption",
    "stem": "The nurse is teaching about carbohydrate digestion. Which enzyme is responsible for breaking down carbohydrates into disaccharides?",
    "choices": {
      "A": "Pancreatic lipase",
      "B": "Trypsin",
      "C": "Pancreatic amylase",
      "D": "Nucleases"
    },
    "correct": "C",
    "rationale": "According to Physiology Digestive system 1.pdf (Page 34), pancreatic amylase breaks down carbohydrates into disaccharides. Pancreatic lipase breaks down lipids, proteases break down proteins, and nucleases break down nucleic acids."
  },
  {
    "id": 76,
    "section": "Physiology of Digestion and Absorption",
    "stem": "A patient has a condition affecting the brush border enzymes. The nurse understands that aminopeptidase and dipeptidase are involved in digesting:",
    "choices": {
      "A": "Carbohydrates",
      "B": "Proteins",
      "C": "Fats",
      "D": "Nucleic acids"
    },
    "correct": "B",
    "rationale": "According to Physiology Digestive system 1.pdf (Page 24), brush border enzymes include carboxypeptidase (removes amino acids from carboxyl end), aminopeptidase (removes amino acids from amino end), and dipeptidase (splits dipeptides into separate amino acids). These enzymes are involved in protein digestion."
  },
  {
    "id": 77,
    "section": "Physiology of Digestion and Absorption",
    "stem": "The nurse is reviewing fat absorption. After fatty acids and monoglycerides are absorbed into epithelial cells, they are repackaged into:",
    "choices": {
      "A": "Micelles",
      "B": "Chylomicrons",
      "C": "Lipoproteins",
      "D": "Bile salts"
    },
    "correct": "B",
    "rationale": "According to Physiology Digestive system 1.pdf (Page 42), fatty acids and monoglycerides leave micelles and diffuse into epithelial cells. There they are recombined and packaged with other fatty substances and proteins to form chylomicrons. Chylomicrons are extruded from epithelial cells by exocytosis and enter lacteals."
  },
  {
    "id": 78,
    "section": "Physiology of Digestion and Absorption",
    "stem": "A patient with pancreatic insufficiency has difficulty digesting fats. The nurse understands that pancreatic lipase requires which substance for optimal function?",
    "choices": {
      "A": "Hydrochloric acid",
      "B": "Bile salts",
      "C": "Intrinsic factor",
      "D": "Pepsin"
    },
    "correct": "B",
    "rationale": "According to Physiology Digestive system 1.pdf (Page 42), bile salts in the duodenum emulsify large fat globules, physically breaking them into smaller fat droplets. Digestion of fat by pancreatic lipase then yields free fatty acids and monoglycerides. Bile salts are essential for emulsification, which increases surface area for lipase action."
  },
  {
    "id": 79,
    "section": "Physiology of Digestion and Absorption",
    "stem": "The nurse is educating a patient about the enteric nervous system (ENS). Which statement accurately describes this system?",
    "choices": {
      "A": "It is part of the central nervous system",
      "B": "It is a self-contained (intrinsic) nervous system that regulates digestive activities",
      "C": "It only controls blood flow to the digestive tract",
      "D": "It is under voluntary control"
    },
    "correct": "B",
    "rationale": "According to Physiology Digestive system 1.pdf (Page 5), the enteric nervous system (ENS) is self-contained (intrinsic) and regulates the activities of the digestive system. It controls motility including peristalsis and segmentation."
  },
  {
    "id": 80,
    "section": "Physiology of Digestion and Absorption",
    "stem": "A patient with a hormone-secreting tumor has elevated cholecystokinin (CCK) levels. The nurse expects which effects?",
    "choices": {
      "A": "Decreased pancreatic enzyme secretion and gallbladder relaxation",
      "B": "Increased output of enzyme-rich pancreatic juice and gallbladder contraction",
      "C": "Increased gastric acid secretion",
      "D": "Decreased bile output from the liver"
    },
    "correct": "B",
    "rationale": "According to Physiology Digestive system 1.pdf (Page 7), cholecystokinin (CCK) is produced by the duodenal mucosa in response to fatty chyme. It increases output of enzyme-rich pancreatic juice and stimulates the gallbladder to contract and expel stored bile. It also inhibits stomach secretory activity. Answer Key Summary Q# Answer Q# Answer Q# Answer Q# Answer 1 B 21 B 41 B 61 C 2 A 22 C 42 C 62 B 3 C 23 B 43 B 63 B 4 B 24 B 44 B 64 C 5 B 25 C 45 B 65 B 6 B 26 D 46 C 66 B 7 B 27 B 47 B 67 B 8 B 28 B 48 C 68 B 9 B 29 C 49 B 69 B 10 B 30 B 50 B 70 B 11 B 31 C 51 B 71 C 12 B 32 C 52 D 72 C 13 C 33 C 53 B 73 B 14 D 34 B 54 B 74 B 15 B 35 B 55 C 75 C 16 A 36 B 56 B 76 B 17 B 37 B 57 B 77 B 18 C 38 B 58 C 78 B 19 B 39 B 59 B 79 B 20 B 40 B 60 C 80 B"
  },
  {
    "id": 81,
    "section": "Part 1: General Organization, Peritoneum, and Histology",
    "stem": "A patient is scheduled for an exploratory laparotomy. The surgeon explains that they will be accessing the \"alimentary canal.\" Which organ would the nurse expect to be included in this specific category?",
    "choices": {
      "A": "Liver",
      "B": "Pancreas",
      "C": "Small intestine",
      "D": "Gallbladder"
    },
    "correct": "C",
    "rationale": "The alimentary canal is the continuous muscular tube from mouth to anus, including the mouth, pharynx, esophagus, stomach, small intestine, large intestine, and anus. Liver, pancreas, and gallbladder are accessory organs."
  },
  {
    "id": 82,
    "section": "Part 1: General Organization, Peritoneum, and Histology",
    "stem": "A student nurse is reviewing the histological layers of the GI tract. Which layer is correctly matched with its primary function?",
    "choices": {
      "A": "Mucosa: Responsible for peristalsis and segmentation.",
      "B": "Submucosa: Contains blood vessels, lymphatic follicles, and nerve plexuses.",
      "C": "Muscularis externa: Outermost layer that anchors the esophagus to surrounding structures.",
      "D": "Serosa: The layer in direct contact with the lumen, secreting mucus."
    },
    "correct": "B",
    "rationale": "The submucosa consists of connective tissue, blood/lymphatic vessels, and nerve plexuses. The muscularis externa is for movement, and the mucosa lines the lumen."
  },
  {
    "id": 83,
    "section": "Part 1: General Organization, Peritoneum, and Histology",
    "stem": "During a physical exam, a patient reports pain in the \"retroperitoneal space.\" Based on anatomical organization, which organ could be the source of this pain?",
    "choices": {
      "A": "Stomach",
      "B": "Jejunum",
      "C": "Pancreas",
      "D": "Ileum"
    },
    "correct": "C",
    "rationale": "The pancreas is a retroperitoneal organ. The stomach, jejunum, and ileum are intraperitoneal."
  },
  {
    "id": 84,
    "section": "Part 1: General Organization, Peritoneum, and Histology",
    "stem": "A patient is diagnosed with an infection in the peritoneal cavity. The nurse knows that this \"potential space\" is located between which two structures?",
    "choices": {
      "A": "The mucosa and submucosa.",
      "B": "The visceral peritoneum and the parietal peritoneum.",
      "C": "The greater omentum and the lesser omentum.",
      "D": "The circular and longitudinal muscle layers."
    },
    "correct": "B",
    "rationale": "The peritoneal cavity is the fluid-filled space between the visceral peritoneum (on organ surfaces) and parietal peritoneum (lining the body wall)."
  },
  {
    "id": 85,
    "section": "Part 1: General Organization, Peritoneum, and Histology",
    "stem": "A patient has a blockage in the mesentery. The nurse understands that this condition is critical because the mesentery provides which essential function?",
    "choices": {
      "A": "Secretion of digestive enzymes.",
      "B": "Routes for blood vessels, lymphatics, and nerves to reach the organs.",
      "C": "Mechanical breakdown of plant cell walls.",
      "D": "Neutralization of acidic chyme using bicarbonate."
    },
    "correct": "B",
    "rationale": "Mesentery is a double layer of peritoneum that provides routes for blood vessels, lymphatics, and nerves, and holds organs in place."
  },
  {
    "id": 86,
    "section": "Part 1: General Organization, Peritoneum, and Histology",
    "stem": "A biopsy of a patient’s esophagus shows a change from stratified squamous epithelium to simple columnar epithelium. At which anatomical junction was this biopsy most likely taken?",
    "choices": {
      "A": "Junction of the pharynx and esophagus.",
      "B": "Junction of the esophagus and stomach.",
      "C": "Junction of the stomach and duodenum.",
      "D": "Junction of the ileum and cecum."
    },
    "correct": "B",
    "rationale": "The esophageal mucosa contains stratified squamous epithelium which changes to simple columnar at the stomach."
  },
  {
    "id": 87,
    "section": "Part 1: General Organization, Peritoneum, and Histology",
    "stem": "While reviewing the histology of the digestive tract, the nurse identifies the \"Myenteric nerve plexus.\" Where is this plexus located?",
    "choices": {
      "A": "Within the lamina propria of the mucosa.",
      "B": "Between the circular and longitudinal layers of the muscularis externa.",
      "C": "In the fibrous adventitia of the esophagus.",
      "D": "Attached to the visceral peritoneum."
    },
    "correct": "B",
    "rationale": "The myenteric nerve plexus is located between the circular and longitudinal muscle layers of the muscularis externa and controls GI motility."
  },
  {
    "id": 88,
    "section": "Part 1: General Organization, Peritoneum, and Histology",
    "stem": "A patient is admitted with a rupture of the \"serosa\" in the abdominal cavity. Which histological layer does this correspond to?",
    "choices": {
      "A": "The innermost lining of the lumen.",
      "B": "The layer containing the submucosal nerve plexus.",
      "C": "The outermost layer of the intraperitoneal organs.",
      "D": "The layer responsible for forming sphincters."
    },
    "correct": "C",
    "rationale": "The serosa is the outermost layer of the alimentary canal in the abdominal cavity."
  },
  {
    "id": 89,
    "section": "Part 1: General Organization, Peritoneum, and Histology",
    "stem": "A nurse is explaining the anatomy of the peritoneum to a student. Which term describes the structure that anchors the liver to the stomach?",
    "choices": {
      "A": "Falciform ligament",
      "B": "Greater omentum",
      "C": "Lesser omentum",
      "D": "Mesentery proper"
    },
    "correct": "C",
    "rationale": "The lesser omentum anchors the liver to the stomach."
  },
  {
    "id": 90,
    "section": "Part 1: General Organization, Peritoneum, and Histology",
    "stem": "A patient presents with a defect in the \"Muscularis mucosae.\" In which major histological layer is this sublayer found?",
    "choices": {
      "A": "Mucosa",
      "B": "Submucosa",
      "C": "Muscularis externa",
      "D": "Serosa"
    },
    "correct": "A",
    "rationale": "The mucosa is made up of three sublayers: epithelium, lamina propria, and muscularis mucosae. -------------------------------------------------------------------------------- Part 2: Oral Cavity, Pharynx, and Esophagus"
  },
  {
    "id": 91,
    "section": "Part 2: Oral Cavity, Pharynx, and Esophagus",
    "stem": "A 5-year-old child is in the clinic for a dental check-up. The nurse notes the child has 20 teeth. Which dental formula represents this primary (deciduous) dentition?",
    "choices": {
      "A": "2I, 1C, 2M (upper); 2I, 1C, 2M (lower) x 2",
      "B": "2I, 1C, 2PM, 3M (upper); 2I, 1C, 2PM, 3M (lower) x 2",
      "C": "1I, 2C, 2M (upper); 1I, 2C, 2M (lower) x 2",
      "D": "2I, 2C, 1M (upper); 2I, 2C, 1M (lower) x 2"
    },
    "correct": "A",
    "rationale": "The primary dental formula is 2 Incisors, 1 Canine, 2 Molars per quadrant, totaling 20 teeth."
  },
  {
    "id": 92,
    "section": "Part 2: Oral Cavity, Pharynx, and Esophagus",
    "stem": "A patient reports a loss of taste on the lateral aspects of the posterior tongue. Which type of papillae is most likely involved?",
    "choices": {
      "A": "Filiform",
      "B": "Fungiform",
      "C": "Vallate",
      "D": "Foliate"
    },
    "correct": "D",
    "rationale": "Foliate papillae are located on the lateral aspects of the posterior tongue."
  },
  {
    "id": 93,
    "section": "Part 2: Oral Cavity, Pharynx, and Esophagus",
    "stem": "During an oral examination, the nurse asks the patient to stick out their tongue to check its position. Which muscles are primarily responsible for altering the tongue’s position?",
    "choices": {
      "A": "Intrinsic muscles",
      "B": "Extrinsic muscles",
      "C": "Pharyngeal constrictors",
      "D": "Masseter muscles"
    },
    "correct": "B",
    "rationale": "Extrinsic muscles alter the tongue’s position; intrinsic muscles change its shape."
  },
  {
    "id": 94,
    "section": "Part 2: Oral Cavity, Pharynx, and Esophagus",
    "stem": "A patient has a blockage in the parotid duct. Where should the nurse inspect for the opening of this duct?",
    "choices": {
      "A": "At the base of the lingual frenulum.",
      "B": "Under the tongue in the floor of the mouth.",
      "C": "In the oral vestibule next to the second upper molar.",
      "D": "Posterior to the vallate papillae on the tongue."
    },
    "correct": "C",
    "rationale": "The parotid duct opens into the oral vestibule next to the second upper molar."
  },
  {
    "id": 95,
    "section": "Part 2: Oral Cavity, Pharynx, and Esophagus",
    "stem": "A patient is diagnosed with \"Xerostomia\" (dry mouth) due to stress. The nurse understands this is caused by which physiological mechanism?",
    "choices": {
      "A": "Parasympathetic stimulation of cranial nerves VII and IX.",
      "B": "Sympathetic stimulation (T1–T3) producing viscous saliva.",
      "C": "Increased release of lysozyme and IgA.",
      "D": "Relaxation of the upper esophageal sphincter."
    },
    "correct": "B",
    "rationale": "Sympathetic stimulation (T1-T3) produces viscous saliva, leading to a dry mouth feeling during stress."
  },
  {
    "id": 96,
    "section": "Part 2: Oral Cavity, Pharynx, and Esophagus",
    "stem": "During the \"Buccal phase\" of swallowing, which event occurs?",
    "choices": {
      "A": "The uvula and larynx rise to block respiratory passages.",
      "B": "The tongue presses against the hard palate, forcing the bolus into the oropharynx.",
      "C": "The upper esophageal sphincter relaxes.",
      "D": "Peristalsis moves the food through the esophagus."
    },
    "correct": "B",
    "rationale": "The buccal phase is voluntary; the tongue presses against the hard palate to move the bolus."
  },
  {
    "id": 97,
    "section": "Part 2: Oral Cavity, Pharynx, and Esophagus",
    "stem": "A patient with GERD (Gastroesophageal Reflux Disease) complains of \"heartburn.\" Which structure is failing to maintain its physiological function?",
    "choices": {
      "A": "Upper esophageal sphincter",
      "B": "Pyloric sphincter",
      "C": "Gastroesophageal (cardiac) sphincter",
      "D": "Ileocecal valve"
    },
    "correct": "C",
    "rationale": "Heartburn occurs when gastric acid regurgitates into the esophagus due to a failure of the gastroesophageal (cardiac) sphincter."
  },
  {
    "id": 98,
    "section": "Part 2: Oral Cavity, Pharynx, and Esophagus",
    "stem": "A nurse is reviewing a patient’s chest X-ray and notes the esophagus passing through the diaphragm. Which anatomical landmark does this represent?",
    "choices": {
      "A": "Cardial orifice",
      "B": "Esophageal hiatus",
      "C": "Epiploic foramen",
      "D": "Porta hepatis"
    },
    "correct": "B",
    "rationale": "The esophagus pierces the diaphragm at the esophageal hiatus."
  },
  {
    "id": 99,
    "section": "Part 2: Oral Cavity, Pharynx, and Esophagus",
    "stem": "A patient is having difficulty swallowing. The nurse knows the esophagus is a flat muscular tube that is usually collapsed. What is the primary motility pattern that moves food through the esophagus?",
    "choices": {
      "A": "Segmentation",
      "B": "Haustral contractions",
      "C": "Peristalsis",
      "D": "Mass movements"
    },
    "correct": "C",
    "rationale": "Motility in the esophagus is by peristalsis (progressive waves of muscle contraction)."
  },
  {
    "id": 100,
    "section": "Part 2: Oral Cavity, Pharynx, and Esophagus",
    "stem": "A patient has a tumor in the \"oropharynx.\" Which histological lining should the nurse expect to find in this area?",
    "choices": {
      "A": "Simple columnar epithelium",
      "B": "Simple cuboidal epithelium",
      "C": "Stratified squamous epithelium",
      "D": "Pseudostratified ciliated columnar epithelium"
    },
    "correct": "C",
    "rationale": "The pharynx (including oropharynx) is lined by stratified squamous epithelium with mucus-producing glands. -------------------------------------------------------------------------------- Part 3: The Stomach"
  },
  {
    "id": 101,
    "section": "Part 3: The Stomach",
    "stem": "A patient presents with pernicious anemia. The nurse understands this may be due to the loss of which cell type in the gastric glands?",
    "choices": {
      "A": "Chief cells",
      "B": "Mucous neck cells",
      "C": "Parietal cells",
      "D": "Enteroendocrine cells"
    },
    "correct": "C",
    "rationale": "Parietal cells secrete intrinsic factor, which is required for the absorption of vitamin B12 in the small intestine."
  },
  {
    "id": 102,
    "section": "Part 3: The Stomach",
    "stem": "A student is identifying the regions of the stomach on a model. Which region is correctly described as the dome-shaped area beneath the diaphragm?",
    "choices": {
      "A": "Cardia",
      "B": "Body",
      "C": "Fundus",
      "D": "Antrum"
    },
    "correct": "C",
    "rationale": "The fundus is the dome-shaped region beneath the diaphragm."
  },
  {
    "id": 103,
    "section": "Part 3: The Stomach",
    "stem": "A patient is taking a medication that inhibits the \"G cells\" of the stomach. What would be the primary effect on digestion?",
    "choices": {
      "A": "Decreased secretion of gastrin and HCl.",
      "B": "Increased production of pepsinogen.",
      "C": "Reduced secretion of thin, acidic mucus.",
      "D": "Accelerated gastric emptying."
    },
    "correct": "A",
    "rationale": "G cells (enteroendocrine cells) secrete gastrin, which stimulates HCl release."
  },
  {
    "id": 104,
    "section": "Part 3: The Stomach",
    "stem": "During the \"Gastric phase\" of secretion, which stimulus leads to the highest release of HCl?",
    "choices": {
      "A": "The sight or thought of food.",
      "B": "Distention of the stomach and a rise in pH.",
      "C": "The presence of acidic chyme in the duodenum.",
      "D": "Stimulation by the sympathetic nervous system."
    },
    "correct": "B",
    "rationale": "The gastric phase is triggered by distention, food, and rising pH, lasting 3–4 hours."
  },
  {
    "id": 105,
    "section": "Part 3: The Stomach",
    "stem": "A nurse explains to a patient that the stomach has an \"extra\" layer of muscle not found in other GI organs. What is this layer?",
    "choices": {
      "A": "Circular layer",
      "B": "Longitudinal layer",
      "C": "Oblique layer",
      "D": "Transverse layer"
    },
    "correct": "C",
    "rationale": "The stomach’s muscularis externa has three layers: circular, longitudinal, and an extra oblique layer."
  },
  {
    "id": 106,
    "section": "Part 3: The Stomach",
    "stem": "In the mechanism of HCl secretion, what is the \"alkaline tide\"?",
    "choices": {
      "A": "The pump of H+ into the stomach lumen.",
      "B": "The movement of bicarbonate (HCO3-) out of the parietal cell into the blood.",
      "C": "The diffusion of CO2 into the parietal cell.",
      "D": "The activation of pepsinogen by HCl."
    },
    "correct": "B",
    "rationale": "As parietal cells pump H+ into the lumen, HCO3- is exported to the blood, creating an alkaline tide."
  },
  {
    "id": 107,
    "section": "Part 3: The Stomach",
    "stem": "A patient’s stomach is empty. The nurse expects to see which anatomical feature upon endoscopy?",
    "choices": {
      "A": "Haustra",
      "B": "Rugae",
      "C": "Villi",
      "D": "Circular folds"
    },
    "correct": "B",
    "rationale": "When empty, the stomach mucosa forms many folds called rugae."
  },
  {
    "id": 108,
    "section": "Part 3: The Stomach",
    "stem": "Which enzyme is responsible for the chemical digestion of proteins in the stomach?",
    "choices": {
      "A": "Salivary amylase",
      "B": "Pancreatic lipase",
      "C": "Pepsin",
      "D": "Trypsin"
    },
    "correct": "C",
    "rationale": "Chief cells secrete pepsinogen, which is activated to pepsin by HCl for protein digestion."
  },
  {
    "id": 109,
    "section": "Part 3: The Stomach",
    "stem": "A patient is experiencing \"retropulsion\" in the stomach. The nurse knows this refers to:",
    "choices": {
      "A": "The delivery of chyme into the duodenum.",
      "B": "The movement of the bolus from the fundus to the pylorus.",
      "C": "The forcing of chyme backward into the stomach to facilitate grinding.",
      "D": "The relaxation of the gastroesophageal sphincter."
    },
    "correct": "C",
    "rationale": "Retropulsion occurs when the pyloric end forces material backward for further mixing/grinding."
  },
  {
    "id": 110,
    "section": "Part 3: The Stomach",
    "stem": "What is the typical pH range of gastric juice produced by parietal cells?",
    "choices": {
      "A": "1.5–3.5",
      "B": "4.5–6.0",
      "C": "7.0–7.4",
      "D": "8.0–9.0"
    },
    "correct": "A",
    "rationale": "Parietal cells secrete HCl, creating a pH of 1.5–3.5. -------------------------------------------------------------------------------- Part 4: Small Intestine and Accessory Organs"
  },
  {
    "id": 111,
    "section": "Part 4: Small Intestine and Accessory Organs",
    "stem": "A patient has a tumor in the \"Duodenum.\" The nurse notes that this organ is mostly:",
    "choices": {
      "A": "Intraperitoneal",
      "B": "Retroperitoneal",
      "C": "Located in the left iliac region",
      "D": "Attached to the spleen"
    },
    "correct": "B",
    "rationale": "The duodenum is mostly retroperitoneal and curves around the head of the pancreas."
  },
  {
    "id": 112,
    "section": "Part 4: Small Intestine and Accessory Organs",
    "stem": "Which structural modification of the small intestine is responsible for the \"brush border\"?",
    "choices": {
      "A": "Circular folds",
      "B": "Villi",
      "C": "Microvilli",
      "D": "Peyer’s patches"
    },
    "correct": "C",
    "rationale": "Microvilli are cytoplasmic extensions that give a fuzzy \"brush border\" appearance and contain enzymes."
  },
  {
    "id": 113,
    "section": "Part 4: Small Intestine and Accessory Organs",
    "stem": "A patient is unable to digest fats effectively. Which hormone, released by the duodenal mucosa, stimulates the gallbladder to contract and the hepatopancreatic sphincter to relax?",
    "choices": {
      "A": "Secretin",
      "B": "Gastrin",
      "C": "Cholecystokinin (CCK)",
      "D": "Motilin"
    },
    "correct": "C",
    "rationale": "CCK stimulates gallbladder contraction and relaxes the hepatopancreatic sphincter."
  },
  {
    "id": 114,
    "section": "Part 4: Small Intestine and Accessory Organs",
    "stem": "A nurse is reviewing a pathology report of a biopsy from the \"distal part of the small intestine.\" The presence of \"Peyer’s patches\" confirms the biopsy is from which section?",
    "choices": {
      "A": "Duodenum",
      "B": "Jejunum",
      "C": "Ileum",
      "D": "Pylorus"
    },
    "correct": "C",
    "rationale": "Peyer’s patches are aggregated lymphoid nodules found in great numbers in the distal part (ileum) of the small intestine."
  },
  {
    "id": 115,
    "section": "Part 4: Small Intestine and Accessory Organs",
    "stem": "A patient has a blockage in the \"Lacteal\" of the villi. Which nutrient absorption will be most affected?",
    "choices": {
      "A": "Glucose",
      "B": "Amino acids",
      "C": "Fatty acids",
      "D": "Vitamin B12"
    },
    "correct": "C",
    "rationale": "Lacteals are lymphatic capillaries in the villi that absorb fatty acids/lipids."
  },
  {
    "id": 116,
    "section": "Part 4: Small Intestine and Accessory Organs",
    "stem": "During \"Segmentation\" in the small intestine, what is the primary physiological goal?",
    "choices": {
      "A": "Rapid propulsion of food toward the large intestine.",
      "B": "Mixing chyme with digestive secretions and mechanical breakdown of fat droplets.",
      "C": "Closure of the ileocecal valve.",
      "D": "Secretion of intrinsic factor."
    },
    "correct": "B",
    "rationale": "Segmentation involves nonadjacent segments contracting/relaxing to mix food and slow its propulsion."
  },
  {
    "id": 117,
    "section": "Part 4: Small Intestine and Accessory Organs",
    "stem": "Which enzyme is a \"Brush border enzyme\" used for the final stage of carbohydrate digestion?",
    "choices": {
      "A": "Pancreatic amylase",
      "B": "Lactase",
      "C": "Pepsin",
      "D": "Trypsin"
    },
    "correct": "B",
    "rationale": "Lactase, maltase, and sucrase are brush border enzymes that break disaccharides into monosaccharides."
  },
  {
    "id": 118,
    "section": "Part 4: Small Intestine and Accessory Organs",
    "stem": "A patient is diagnosed with an infection of the \"Kupffer cells.\" In which organ are these cells located?",
    "choices": {
      "A": "Pancreas",
      "B": "Spleen",
      "C": "Liver",
      "D": "Gallbladder"
    },
    "correct": "C",
    "rationale": "Kupffer cells (hepatic macrophages) are located in the liver sinusoids."
  },
  {
    "id": 119,
    "section": "Part 4: Small Intestine and Accessory Organs",
    "stem": "A nurse is teaching a student about the \"Portal Triad.\" Which three structures are found at the corner of each liver lobule?",
    "choices": {
      "A": "Central vein, Hepatic artery, Bile duct.",
      "B": "Branch of hepatic artery, Branch of hepatic portal vein, Bile duct.",
      "C": "Hepatic vein, Cystic duct, Portal vein.",
      "D": "Left hepatic duct, Right hepatic duct, Common hepatic duct."
    },
    "correct": "B",
    "rationale": "The portal triad consists of a branch of the hepatic artery, a branch of the hepatic portal vein, and a bile duct."
  },
  {
    "id": 120,
    "section": "Part 4: Small Intestine and Accessory Organs",
    "stem": "Bile salts are essential for which process?",
    "choices": {
      "A": "Chemical digestion of proteins.",
      "B": "Emulsification of fats.",
      "C": "Absorption of Vitamin K.",
      "D": "Neutralization of HCl."
    },
    "correct": "B",
    "rationale": "Bile salts emulsify fat, breaking it into small droplets for lipase action."
  },
  {
    "id": 121,
    "section": "Part 4: Small Intestine and Accessory Organs",
    "stem": "A patient’s bile duct is blocked by a stone. The nurse knows that the common bile duct (CBD) is formed by the union of which two ducts?",
    "choices": {
      "A": "Right and left hepatic ducts.",
      "B": "Common hepatic duct and cystic duct.",
      "C": "Cystic duct and pancreatic duct.",
      "D": "Common hepatic duct and pancreatic duct."
    },
    "correct": "B",
    "rationale": "The common hepatic duct (CHD) is joined by the cystic duct to form the common bile duct (CBD)."
  },
  {
    "id": 122,
    "section": "Part 4: Small Intestine and Accessory Organs",
    "stem": "The \"Ampulla of Vater\" (hepatopancreatic ampulla) opens into which part of the GI tract?",
    "choices": {
      "A": "First part of the duodenum.",
      "B": "Second part of the duodenum.",
      "C": "Jejunum.",
      "D": "Cardia of the stomach."
    },
    "correct": "B",
    "rationale": "The ampulla opens into the 2nd part of the duodenum at the major duodenal papilla."
  },
  {
    "id": 123,
    "section": "Part 4: Small Intestine and Accessory Organs",
    "stem": "A patient is diagnosed with \"Pancreatitis.\" The nurse knows the exocrine function of the pancreas involves \"Acini\" that produce:",
    "choices": {
      "A": "Insulin and glucagon.",
      "B": "Zymogen granules containing proenzymes.",
      "C": "Hydrochloric acid and intrinsic factor.",
      "D": "Bile salts and bilirubin."
    },
    "correct": "B",
    "rationale": "Acini are clusters of secretory cells that produce pancreatic juice/proenzymes (exocrine function)."
  },
  {
    "id": 124,
    "section": "Part 4: Small Intestine and Accessory Organs",
    "stem": "Which hormone stimulates the pancreas to secrete a juice rich in bicarbonate ions?",
    "choices": {
      "A": "Gastrin",
      "B": "CCK",
      "C": "Secretin",
      "D": "Histamine"
    },
    "correct": "C",
    "rationale": "Secretin increases the output of pancreatic juice rich in bicarbonate ions."
  },
  {
    "id": 125,
    "section": "Part 4: Small Intestine and Accessory Organs",
    "stem": "What is the \"Enterohepatic circulation\"?",
    "choices": {
      "A": "The movement of food through the small intestine.",
      "B": "The recycling of bile salts from the ileum back to the liver via the portal vein.",
      "C": "The drainage of blood from the liver into the inferior vena cava.",
      "D": "The secretion of hormones from the duodenum to the pancreas."
    },
    "correct": "B",
    "rationale": "95% of bile salts are reabsorbed in the ileum and returned to the liver via the portal vein. -------------------------------------------------------------------------------- Part 5: Large Intestine and Nutrient Absorption"
  },
  {
    "id": 126,
    "section": "Part 5: Large Intestine and Nutrient Absorption",
    "stem": "A patient is scheduled for an \"Appendectomy.\" The nurse knows the appendix is attached to which part of the large intestine?",
    "choices": {
      "A": "Cecum",
      "B": "Ascending colon",
      "C": "Sigmoid colon",
      "D": "Rectum"
    },
    "correct": "A",
    "rationale": "The appendix is a mass of lymphoid tissue attached to the cecum."
  },
  {
    "id": 127,
    "section": "Part 5: Large Intestine and Nutrient Absorption",
    "stem": "While reviewing the anatomy of the large intestine, the nurse identifies \"Teniae coli.\" What are these?",
    "choices": {
      "A": "Pocketlike sacs in the colon wall.",
      "B": "Fat-filled pouches of visceral peritoneum.",
      "C": "Three bands of longitudinal smooth muscle.",
      "D": "Permanent circular folds of the mucosa."
    },
    "correct": "C",
    "rationale": "Teniae coli are three bands of longitudinal smooth muscle in the muscularis."
  },
  {
    "id": 128,
    "section": "Part 5: Large Intestine and Nutrient Absorption",
    "stem": "A patient reports pain in the \"left colic flexure.\" Where is this located?",
    "choices": {
      "A": "Between the cecum and ascending colon.",
      "B": "Between the ascending and transverse colon.",
      "C": "Between the transverse and descending colon.",
      "D": "Between the descending and sigmoid colon."
    },
    "correct": "C",
    "rationale": "The left colic (splenic) flexure is the turn between the transverse and descending colon."
  },
  {
    "id": 129,
    "section": "Part 5: Large Intestine and Nutrient Absorption",
    "stem": "The nurse explains to a patient that \"bacterial flora\" in the large intestine are beneficial because they:",
    "choices": {
      "A": "Produce HCl to kill bacteria.",
      "B": "Synthesize B complex vitamins and Vitamin K.",
      "C": "Secrete brush border enzymes for protein digestion.",
      "D": "Emulsify fats for absorption."
    },
    "correct": "B",
    "rationale": "Resident bacteria synthesize B-complex vitamins and Vitamin K."
  },
  {
    "id": 130,
    "section": "Part 5: Large Intestine and Nutrient Absorption",
    "stem": "During the defecation reflex, which event is under voluntary control?",
    "choices": {
      "A": "Distention of the rectum.",
      "B": "Contraction of the sigmoid colon.",
      "C": "Relaxation of the internal anal sphincter.",
      "D": "Relaxation of the external anal sphincter."
    },
    "correct": "D",
    "rationale": "The external anal sphincter is composed of skeletal muscle and is under voluntary control."
  },
  {
    "id": 131,
    "section": "Part 5: Large Intestine and Nutrient Absorption",
    "stem": "Which nutrient requires \"cotransport with sodium ions\" for absorption in the small intestine?",
    "choices": {
      "A": "Fructose",
      "B": "Glucose and Galactose",
      "C": "Fatty acids",
      "D": "Vitamin D"
    },
    "correct": "B",
    "rationale": "Glucose and galactose are absorbed via cotransport with sodium ions."
  },
  {
    "id": 132,
    "section": "Part 5: Large Intestine and Nutrient Absorption",
    "stem": "A patient has a condition that reduces \"Pancreatic Lipase\" secretion. Which digestive process will be impaired?",
    "choices": {
      "A": "Breakdown of starch into oligosaccharides.",
      "B": "Breakdown of triglycerides into fatty acids and monoglycerides.",
      "C": "Breakdown of proteins into amino acids.",
      "D": "Breakdown of nucleic acids into nucleotides."
    },
    "correct": "B",
    "rationale": "Pancreatic lipase breaks lipids (fats) into fatty acids and glycerol/monoglycerides."
  },
  {
    "id": 133,
    "section": "Part 5: Large Intestine and Nutrient Absorption",
    "stem": "How are \"Chylomicrons\" transported away from the intestinal mucosa?",
    "choices": {
      "A": "Via the hepatic portal vein to the liver.",
      "B": "Via the capillaries to the systemic circulation.",
      "C": "Via the lacteals and the lymphatic system.",
      "D": "Via the bile duct to the gallbladder."
    },
    "correct": "C",
    "rationale": "Chylomicrons enter lacteals and are carried away in lymph."
  },
  {
    "id": 134,
    "section": "Part 5: Large Intestine and Nutrient Absorption",
    "stem": "A patient has an injury below the \"Pectinate line\" in the anal canal. The nurse should assess for:",
    "choices": {
      "A": "Dull, poorly localized visceral pain.",
      "B": "Sharp somatic pain, as the region is sensitive to pain.",
      "C": "Presence of Peyer’s patches.",
      "D": "Secretion of intrinsic factor."
    },
    "correct": "B",
    "rationale": "The region inferior to the pectinate line is innervated by somatic nerves and is sensitive to pain."
  },
  {
    "id": 135,
    "section": "Part 5: Large Intestine and Nutrient Absorption",
    "stem": "What is the primary function of the \"Haustra\" in the large intestine?",
    "choices": {
      "A": "Increasing surface area for nutrient absorption.",
      "B": "Pocketlike sacs that facilitate slow segmental movement.",
      "C": "Production of vitamin K.",
      "D": "Storage of bile."
    },
    "correct": "B",
    "rationale": "Haustra are pocketlike sacs caused by the tone of teniae coli; haustral contractions provide slow segmental movement. -------------------------------------------------------------------------------- Part 6: Physical Assessment and Clinical Correlation"
  },
  {
    "id": 136,
    "section": "Part 6: Physical Assessment and Clinical Correlation",
    "stem": "A nurse is preparing to perform a physical assessment of a patient's abdomen. In what order should the assessment techniques be performed?",
    "choices": {
      "A": "Inspection, Palpation, Percussion, Auscultation.",
      "B": "Inspection, Auscultation, Percussion, Palpation.",
      "C": "Auscultation, Inspection, Palpation, Percussion.",
      "D": "Palpation, Percussion, Auscultation, Inspection."
    },
    "correct": "B",
    "rationale": "Auscultation should be performed after inspection and before percussion/palpation to avoid inducing changes in bowel sounds."
  },
  {
    "id": 137,
    "section": "Part 6: Physical Assessment and Clinical Correlation",
    "stem": "During inspection, the nurse notes \"Caput medusae\" (enlarged veins on the abdomen). This is a clinical sign of which condition?",
    "choices": {
      "A": "Appendicitis",
      "B": "Cholecystitis",
      "C": "Portal Hypertension",
      "D": "Bowel Obstruction"
    },
    "correct": "C",
    "rationale": "Caput medusae is associated with portal hypertension."
  },
  {
    "id": 138,
    "section": "Part 6: Physical Assessment and Clinical Correlation",
    "stem": "A patient reports sharp pain when the nurse rapidly removes their hand after deep palpation. What is the name of this finding?",
    "choices": {
      "A": "Guarding",
      "B": "Rebound tenderness",
      "C": "Borborygmi",
      "D": "Palmar erythema"
    },
    "correct": "B",
    "rationale": "Rebound tenderness is pain worsened on releasing pressure, suggesting peritoneal irritation (peritonitis)."
  },
  {
    "id": 139,
    "section": "Part 6: Physical Assessment and Clinical Correlation",
    "stem": "While percussing the abdomen, the nurse hears a \"tympany\" sound. Where is this sound typically heard?",
    "choices": {
      "A": "Over solid organs like the liver.",
      "B": "Over a full bladder.",
      "C": "Over air-filled sections of the stomach or intestine.",
      "D": "Over the heart."
    },
    "correct": "C",
    "rationale": "Tympany is the predominant sound heard over air-filled sections of the stomach/intestine."
  },
  {
    "id": 140,
    "section": "Part 6: Physical Assessment and Clinical Correlation",
    "stem": "The nurse is assessing for \"Ascites.\" Which test involves tapping one side of the abdomen and feeling for a wave transmission on the other side?",
    "choices": {
      "A": "Shifting dullness test",
      "B": "Fluid thrill test",
      "C": "McBurney’s point palpation",
      "D": "Rovsing’s sign"
    },
    "correct": "B",
    "rationale": "The fluid thrill test involves feeling for a palpable wave transmitted across the abdomen."
  },
  {
    "id": 141,
    "section": "Part 6: Physical Assessment and Clinical Correlation",
    "stem": "A patient is suspected of having \"Appendicitis.\" The nurse palpates the \"Left Lower Quadrant\" (LLQ), and the patient feels pain in the \"Right Lower Quadrant\" (RLQ). What is this sign called?",
    "choices": {
      "A": "Murphy’s Sign",
      "B": "McBurney’s Sign",
      "C": "Rovsing’s Sign",
      "D": "Psoas Sign"
    },
    "correct": "C",
    "rationale": "Rovsing’s sign is when palpation in the left iliac fossa produces pain in the right iliac fossa."
  },
  {
    "id": 142,
    "section": "Part 6: Physical Assessment and Clinical Correlation",
    "stem": "A nurse is measuring the \"Liver span\" at the midclavicular line (MCL). What is the normal range?",
    "choices": {
      "A": "2–4 cm",
      "B": "6–12 cm",
      "C": "15–20 cm",
      "D": "1–2 cm"
    },
    "correct": "B",
    "rationale": "The normal liver span at the MCL is 6–12 cm."
  },
  {
    "id": 143,
    "section": "Part 6: Physical Assessment and Clinical Correlation",
    "stem": "During a general examination, the nurse notes \"Koilonychia\" (spooning of the nails). This finding is associated with which condition?",
    "choices": {
      "A": "Liver failure",
      "B": "Chronic iron deficiency anemia",
      "C": "Cirrhosis",
      "D": "Coeliac disease"
    },
    "correct": "B",
    "rationale": "Koilonychia suggests chronic iron deficiency anemia."
  },
  {
    "id": 144,
    "section": "Part 6: Physical Assessment and Clinical Correlation",
    "stem": "A patient has \"Leukonychia\" (whitened nail beds). The nurse knows this may be a sign of:",
    "choices": {
      "A": "GI bleeding",
      "B": "Hypoalbuminemia or liver failure",
      "C": "Excessive alcohol intake",
      "D": "Acute appendicitis"
    },
    "correct": "B",
    "rationale": "Leukonychia is associated with hypoalbuminemia or liver failure."
  },
  {
    "id": 145,
    "section": "Part 6: Physical Assessment and Clinical Correlation",
    "stem": "While assessing the mouth, the nurse identifies a \"Lingual frenulum.\" What is its function?",
    "choices": {
      "A": "Secretion of salivary amylase.",
      "B": "Attachment of the tongue to the floor of the mouth.",
      "C": "Separation of the nasopharynx from the oropharynx.",
      "D": "Mechanical breakdown of food."
    },
    "correct": "B",
    "rationale": "The lingual frenulum attaches the tongue to the floor of the mouth."
  },
  {
    "id": 146,
    "section": "Part 6: Physical Assessment and Clinical Correlation",
    "stem": "A nurse is performing \"Light palpation\" on a patient’s abdomen. What is the standard depth for this technique?",
    "choices": {
      "A": "1 cm",
      "B": "5–6 cm",
      "C": "10 cm",
      "D": "0.5 cm"
    },
    "correct": "A",
    "rationale": "Light palpation is performed to a depth of 1 cm."
  },
  {
    "id": 147,
    "section": "Part 6: Physical Assessment and Clinical Correlation",
    "stem": "A patient presents with \"Jaundice\" (icterus). Where is the best place for the nurse to inspect for this sign?",
    "choices": {
      "A": "Palms of the hands",
      "B": "Sclera of the eyes",
      "C": "The umbilicus",
      "D": "The buccal mucosa"
    },
    "correct": "B",
    "rationale": "Jaundice is best assessed in the sclera of the eyes."
  },
  {
    "id": 148,
    "section": "Part 6: Physical Assessment and Clinical Correlation",
    "stem": "A patient is observed to have \"Dupuytren’s contracture.\" This thickening of the palmar fascia is often associated with:",
    "choices": {
      "A": "Iron deficiency",
      "B": "Excess alcohol intake",
      "C": "Vitamin K deficiency",
      "D": "Chronic diarrhea"
    },
    "correct": "B",
    "rationale": "Dupuytren’s contracture is associated with excess alcohol intake or family history."
  },
  {
    "id": 149,
    "section": "Part 6: Physical Assessment and Clinical Correlation",
    "stem": "When percussing the spleen, the nurse knows that \"Splenomegaly\" is typically only detected when the spleen enlarges to what degree?",
    "choices": {
      "A": "1.5 times its normal size",
      "B": "2 times its normal size",
      "C": "3 times its normal size",
      "D": "5 times its normal size"
    },
    "correct": "C",
    "rationale": "Splenomegaly is detected when the spleen enlarges 3 times its normal size."
  },
  {
    "id": 150,
    "section": "Part 6: Physical Assessment and Clinical Correlation",
    "stem": "A patient has \"Hyperactive\" bowel sounds. The nurse knows this might indicate:",
    "choices": {
      "A": "Late bowel obstruction",
      "B": "Early bowel obstruction",
      "C": "Peritonitis",
      "D": "Normal digestion"
    },
    "correct": "B",
    "rationale": "Hyperactive bowel sounds (5-6 sounds in < 30 secs) can indicate early obstruction. -------------------------------------------------------------------------------- Part 7: Integrated Physiology and Regulation"
  },
  {
    "id": 151,
    "section": "Part 7: Integrated Physiology and Regulation",
    "stem": "Which nervous system is considered \"self-contained\" (intrinsic) and regulates GI motility and secretory activity?",
    "choices": {
      "A": "Somatic Nervous System",
      "B": "Enteric Nervous System (ENS)",
      "C": "Central Nervous System",
      "D": "Sympathetic Nervous System"
    },
    "correct": "B",
    "rationale": "The Enteric Nervous System (ENS) is the intrinsic nerve supply to the GI tract wall."
  },
  {
    "id": 152,
    "section": "Part 7: Integrated Physiology and Regulation",
    "stem": "A patient is salivating at the smell of food. This is an example of which phase of gastric regulation?",
    "choices": {
      "A": "Gastric phase",
      "B": "Intestinal phase",
      "C": "Cephalic phase",
      "D": "Buccal phase"
    },
    "correct": "C",
    "rationale": "The cephalic phase occurs before food enters the stomach, triggered by smell, taste, sight, or thought."
  },
  {
    "id": 153,
    "section": "Part 7: Integrated Physiology and Regulation",
    "stem": "What is the \"Migrating Motor Complex\"?",
    "choices": {
      "A": "A reflex that causes defecation.",
      "B": "A pattern of peristaltic activity during fasting, stimulated by motilin.",
      "C": "The movement of the bolus through the pharynx.",
      "D": "The recycling of bile salts."
    },
    "correct": "B",
    "rationale": "Motilin stimulates the migrating motor complex every 1.5–2 hours during fasting."
  },
  {
    "id": 154,
    "section": "Part 7: Integrated Physiology and Regulation",
    "stem": "A patient is experiencing \"Reverse peristalsis.\" This is a key physiological component of which process?",
    "choices": {
      "A": "Segmentation",
      "B": "Defecation",
      "C": "Vomiting",
      "D": "Deglutition"
    },
    "correct": "C",
    "rationale": "Vomiting involves reverse peristalsis in the small intestine."
  },
  {
    "id": 155,
    "section": "Part 7: Integrated Physiology and Regulation",
    "stem": "Which hormone inhibits gastric gland secretion and gastric motility when the stomach is too empty or chyme is too fatty?",
    "choices": {
      "A": "Gastrin",
      "B": "Enterogastrones (like CCK and Secretin)",
      "C": "Histamine",
      "D": "Serotonin"
    },
    "correct": "B",
    "rationale": "CCK and Secretin inhibit the stomach’s secretory activity and motility."
  },
  {
    "id": 156,
    "section": "Part 7: Integrated Physiology and Regulation",
    "stem": "The \"Round ligament\" (ligamentum teres) of the liver is a remnant of which fetal structure?",
    "choices": {
      "A": "Ductus venosus",
      "B": "Umbilical vein",
      "C": "Umbilical artery",
      "D": "Foramen ovale"
    },
    "correct": "B",
    "rationale": "The round ligament is the remnant of the fetal umbilical vein."
  },
  {
    "id": 157,
    "section": "Part 7: Integrated Physiology and Regulation",
    "stem": "A patient has a deficiency in \"Vitamin K.\" The nurse knows this will primarily affect the liver's ability to:",
    "choices": {
      "A": "Store iron.",
      "B": "Synthesize blood clotting factors.",
      "C": "Produce bile salts.",
      "D": "Detoxify drugs."
    },
    "correct": "B",
    "rationale": "Vitamin K is essential for the synthesis of blood clotting factors in the liver."
  },
  {
    "id": 158,
    "section": "Part 7: Integrated Physiology and Regulation",
    "stem": "Which digestive enzyme is responsible for breaking down nucleic acids?",
    "choices": {
      "A": "Amylase",
      "B": "Lipase",
      "C": "Nuclease",
      "D": "Pepsin"
    },
    "correct": "C",
    "rationale": "Nucleases break down nucleic acids into nucleotides."
  },
  {
    "id": 159,
    "section": "Part 7: Integrated Physiology and Regulation",
    "stem": "What is the role of \"Vasoactive Intestinal Peptide\" (VIP)?",
    "choices": {
      "A": "Stimulates HCl release.",
      "B": "Causes contraction of the gallbladder.",
      "C": "Stimulates buffer secretion and dilates intestinal capillaries.",
      "D": "Inhibits insulin release."
    },
    "correct": "C",
    "rationale": "VIP stimulates buffer secretion, dilates capillaries, and relaxes intestinal smooth muscle."
  },
  {
    "id": 160,
    "section": "Part 7: Integrated Physiology and Regulation",
    "stem": "A patient's feces are observed to be a brown color. This is primarily due to:",
    "choices": {
      "A": "Undigested carbohydrates.",
      "B": "Bile pigments.",
      "C": "Fatty acids.",
      "D": "Pancreatic lipase."
    },
    "correct": "B",
    "rationale": "Bile pigments are responsible for the brown color of feces."
  }
]
